tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "tavianator/tap"

brew "cocoapods"
brew "coreutils"
brew "docker"
brew "node"
brew "firebase-cli"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "gradle"
brew "htop"
brew "kotlin"
brew "openjdk@11"
brew "kotlin-language-server"
brew "kubernetes-cli"
brew "less"
brew "mas"
brew "mat2"
brew "neomutt"
brew "neovim"
brew "pandoc"
brew "ripgrep"
brew "sk"
brew "starship"
brew "stow"
brew "subversion"
brew "texlab"
brew "tmux", args: ["HEAD"]
brew "tree"
brew "vim"
brew "watchman"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "tavianator/tap/bfs"

cask "adoptopenjdk8"
cask "alacritty"
cask "android-sdk"
cask "android-studio"
cask "balenaetcher"
cask "discord"
cask "firefox"
cask "firefox-developer-edition"
cask "font-sauce-code-pro-nerd-font"
cask "google-chrome-dev"
cask "google-cloud-sdk"
cask "intellij-idea-ce"
cask "keepassxc"
cask "logitech-options"
cask "mactex-no-gui"
cask "rectangle"
cask "signal"
cask "slack"
cask "spotify"

mas "Xcode", id: 497799835
