tap "coursier/formulas"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "superfly/tap"
tap "tavianator/tap"
brew "bat"
brew "cocoapods"
brew "coreutils"
brew "harfbuzz"
brew "gh"
brew "ghc"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "gradle"
brew "haskell-language-server"
brew "helm"
brew "htop"
brew "isync"
brew "jdtls"
brew "jq"
brew "kotlin"
brew "kotlin-language-server"
brew "kubernetes-cli"
brew "less"
brew "llvm"
brew "lua-language-server"
brew "mas"
brew "mat2"
brew "mysql-client"
brew "neovim"
brew "pandoc"
brew "parallel"
brew "pinentry-mac"
brew "pyright"
brew "ripgrep"
brew "rust"
brew "rust-analyzer"
brew "sk"
brew "stow"
brew "stylua"
brew "subversion"
brew "svtplay-dl"
brew "terraform"
brew "texlab"
brew "tmux", args: ["HEAD"]
brew "tree"
brew "vim"
brew "volta"
brew "watchman"
brew "wget"
brew "youtube-dl"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "coursier/formulas/coursier"
brew "superfly/tap/flyctl"
brew "tavianator/tap/bfs"
cask "1password-beta"
cask "1password-cli"
cask "android-studio"
cask "arctype"
cask "cron"
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "hey"
cask "hiddenbar"
cask "intellij-idea"
cask "iterm2"
cask "karabiner-elements"
cask "linear-linear"
cask "logitech-options"
cask "logseq"
cask "macfuse"
cask "mactex-no-gui"
cask "microsoft-teams"
cask "raycast"
cask "rectangle"
cask "signal"
cask "slack"
cask "spotify"
cask "temurin"
cask "temurin11"
cask "ticktick"
cask "zoom"
