tap "coursier/formulas"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "cocoapods"
brew "coreutils"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "gnupg"
brew "gradle"
brew "htop"
brew "kotlin"
brew "kotlin-language-server"
brew "kubernetes-cli"
brew "less"
brew "lua-language-server"
brew "mas"
brew "mat2"
brew "neovim", args: ["HEAD"]
brew "pandoc"
brew "ripgrep"
brew "sk"
brew "stow"
brew "subversion"
brew "texlab"
brew "tmux", args: ["HEAD"]
brew "tree"
brew "vim"
brew "volta"
brew "watchman"
brew "wget"
brew "youtube-dl"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "coursier/formulas/coursier"
cask "1password"
cask "1password-cli"
cask "android-studio"
cask "discord"
cask "docker"
cask "firefox"
cask "flutter"
cask "font-source-code-pro"
cask "google-chrome"
cask "google-cloud-sdk"
cask "intellij-idea-ce"
cask "karabiner-elements"
cask "kitty"
cask "logitech-options"
cask "macfuse"
cask "mactex-no-gui"
cask "raycast"
cask "rectangle"
cask "signal"
cask "slack"
cask "spotify"
cask "temurin11"
cask "veracrypt"
cask "zoom"
mas "GarageBand", id: 682658836
mas "Hand Mirror", id: 1502839586
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Messenger", id: 1480068668
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
