tap "axllent/apps"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "tavianator/tap"
brew "bat"
brew "php"
brew "composer"
brew "coreutils"
brew "dnsmasq"
brew "ffmpeg"
brew "firebase-cli"
brew "fnm"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "helm"
brew "kubectl"
brew "jq"
brew "less"
brew "mysql", restart_service: true
brew "neovim"
brew "ruby"
brew "nginx"
brew "pinentry-mac"
brew "ripgrep"
brew "sk"
brew "svtplay-dl"
brew "vim"
brew "youtube-dl"
brew "zsh"
brew "axllent/apps/mailpit"
brew "tavianator/tap/bfs"
cask "1password"
cask "1password-cli"
cask "android-studio"
cask "arc"
cask "cleanshot"
cask "cron"
cask "discord"
cask "docker"
cask "figma"
cask "font-source-code-pro"
cask "github"
cask "google-cloud-sdk"
cask "hey"
cask "intellij-idea"
cask "iterm2"
cask "karabiner-elements"
cask "phpstorm"
cask "raycast"
cask "spotify"
cask "tableplus"
cask "zed"
cask "slack"
cask "temurin17"
