tap "axllent/apps"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "planetscale/tap"
tap "tavianator/tap"
brew "bat"
brew "cloudflared"
brew "coreutils"
brew "coursier"
brew "curl"
brew "ffmpeg"
brew "node"
brew "firebase-cli"
brew "flyctl"
brew "fnm"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "imagemagick"
brew "jq"
brew "less"
brew "maven"
brew "mysql", restart_service: true
brew "mysql-client"
brew "neovim"
brew "pinentry-mac"
brew "ripgrep"
brew "ruby"
brew "sk"
brew "svtplay-dl"
brew "vim"
brew "youtube-dl"
brew "zsh"
brew "axllent/apps/mailpit"
brew "planetscale/tap/pscale"
brew "tavianator/tap/bfs"
cask "1password"
cask "1password-cli"
cask "android-studio"
cask "arc"
cask "cleanshot"
cask "cron"
cask "datagrip"
cask "discord"
cask "docker"
cask "figma"
cask "font-source-code-pro"
cask "github"
cask "google-cloud-sdk"
cask "herd"
cask "hey"
cask "httpie"
cask "intellij-idea"
cask "iterm2"
cask "karabiner-elements"
cask "kitty"
cask "mactex-no-gui"
cask "phpstorm"
cask "raycast"
cask "slack"
cask "spotify"
cask "tableplus"
cask "temurin17"
cask "vlc"
cask "warp"
cask "zed"
cask "zoom"
