# Taps
tap "coursier/formulas"
tap "dopplerhq/cli"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "planetscale/tap"
tap "tavianator/tap"

# Brews
brew "bat"
brew "coreutils"
brew "coursier/formulas/coursier"
brew "dopplerhq/cli/doppler"
brew "ffmpeg"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "gradle"
brew "jdtls"
brew "jq"
brew "less"
brew "llvm"
brew "mas"
brew "mysql-client"
brew "neovim"
brew "pandoc"
brew "parallel"
brew "pinentry-mac"
brew "pscale"
brew "pyright"
brew "ripgrep"
brew "rustup-init"
brew "sk"
brew "stylua"
brew "svtplay-dl"
brew "tavianator/tap/bfs"
brew "terraform"
brew "texlab"
brew "tree"
brew "vim"
brew "volta"
brew "wget"
brew "youtube-dl"
brew "zsh"

# Casks
cask "1password"
cask "1password-cli"
cask "android-studio"
cask "arc"
cask "arctype"
cask "cleanshot"
cask "cron"
cask "docker"
cask "figma"
cask "firefox-developer-edition"
cask "google-chrome-canary"
cask "google-cloud-sdk"
cask "google-drive"
cask "hammerspoon"
cask "hiddenbar"
cask "httpie"
cask "intellij-idea"
cask "karabiner-elements"
cask "logitech-options"
cask "mactex-no-gui"
cask "microsoft-excel"
cask "raycast"
cask "spotify"
cask "temurin"
cask "temurin11"
cask "warp"
cask "warp"
cask "zoom"

# Fonts
cask "font-source-code-pro"

# Apps from the Mac App Store
mas "GarageBand", id: 682658836
mas "Hand Mirror", id: 1502839586
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
